app/views/projects/show.html.erb

SELECT "complements".* FROM "complements" WHERE "complements"."project_id" = 2
SELECT COUNT(*) FROM "complements" WHERE "complements"."project_id" = 1
---

<% unless @project.complements.empty?  %>