app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 14 Dec 2012 01:58:57 UTC +00:00], ["name", "projecto 1"], ["updated_at", Fri, 14 Dec 2012 01:58:57 UTC +00:00]]

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]